emacs/.config/emacs/config.org

#+TITLE: Literate Emacs Config
#+AUTHOR: Jon Harder
#+STARTUP: fold
* Overview
This configuration combines the documentation and organization of a
literate config file using org mode, and the quick parsing and starwrite the code into
dedicated elisp files.

The secret to this configuration is the ~:tangle SOURCE~ syntax which
writes the contents to the specified file. In order to keep this up to
date, the emacs command, ~M-x org-babel-tangle~ must be ran after
modifying this file.

* Base Settings

Sets things like the theme and font.  Actually using and loading
themes, setting font configuration, etc. is handled later in the
configuration.

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (defvar my-theme '(doom-themes . doom-material-dark)
    "Cons of the symbols representing the theme package, and theme name.")
  
  (defvar my-font '(:name "JetBrains Mono" :size 170)
    "Font (:name string :size integer).")
#+end_src
* Early init optimizations
** Disable built-in package.el
 #+begin_src emacs-lisp :tangle "early-init.el"
   ;;; early-init.el --- The first lisp code emacs runs before normal initialization. -*- lexical-binding: t -*-
   ;;; Commentary:
   ;; This file is evaluated at the very start of Emacs initialization.
   ;; It is used here to ensure the native `package' initialization is inhibeted.

   ;;; Code:

   ;; disable package.el in favor of straight.el
   (setq package-enable-at-startup nil)
 #+end_src

  #+RESULTS:

** Startup performance enhancements
The aim here is to effectively disable the garbage collector during startup
as Emacs is not interactible during startup anyway. In the startup-hook we
restore these settings to sensible values for runtime.

 #+begin_src emacs-lisp :tangle early-init.el
   (setq gc-cons-threshold most-positive-fixnum
         gc-cons-percentage 0.5)
 #+end_src

** Performance monitoring
It's helpful to track how long Emacs takes to load up. This normally
isn't the most critical metric to track as I usually run emacs with
~emacs --daemon~, and open new emacs windows with ~emacsclient~, but
helpful nonetheless.

#+begin_src emacs-lisp :tangle "early-init.el"
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 1024 1024 20)
                    gc-cons-percentage 0.2)
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* Package management
** Set up straight.el (package management)

 #+begin_src emacs-lisp :tangle "init.el"
   ;;; init --- Basic, initial settings -*- lexical-binding: t -*-

   ;;; Commentary:
   ;;; This setups up straight.el for package management and
   ;;; loads my modules

   ;;; Code:

   (setq straight-repository-branch "develop")

   (defvar bootstrap-version)
   (let ((bootstrap-file
          (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
         (bootstrap-verision 6))
     (unless (file-exists-p bootstrap-file)
       (with-current-buffer
   		(url-retrieve-synchronously
   		 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
   		 'silent 'inhibit-cookies)
         (goto-char (point-max))
         (eval-print-last-sexp)))
     (load bootstrap-file nil 'nomessage))
   (setq straight-built-in-pseudo-packages
   	  '(emacs nadvice python image-mode project flymake))
 #+end_src
** Local lisp loading
*** Load local-config
There are some configuration settings that are local to the particular
machine I'm running emacs on. These settings are stored in the file,
=local-config.el=.

This gets loaded first so that any later configuration can utilize it.

#+begin_src emacs-lisp :tangle "init.el"
  (load-file (expand-file-name "local-config.el" user-emacs-directory))
#+end_src
*** Adding my-modules to the load path
#+begin_src emacs-lisp :tangle "init.el"
   (add-to-list 'load-path (locate-user-emacs-file "my-modules"))
#+end_src

** Require all my modules
#+begin_src emacs-lisp :tangle "init.el"
  (require 'my-appearance)
  (require 'my-util)
  (require 'my-core)
  (require 'my-mouse)
  (require 'my-meow)
  (require 'my-modeline)

  (require 'my-calendar)
  (require 'my-completion)
  (require 'my-tree-sitter)
  (require 'my-gtd)
  (require 'my-denote)
  (require 'my-dired)
  (require 'my-docker-mode)
  (require 'my-ediff)
  (require 'my-email)
  (require 'my-epub)
  (require 'my-feed)
  (require 'my-gpg)
  (require 'my-go-mode)
  (require 'my-help)
  (require 'my-http)
  (require 'my-icons)
  (require 'my-lisp-mode)
  (require 'my-git)
  (require 'my-markup)
  (require 'my-navigation)
  (require 'my-web)
  (require 'my-neon-mode)
  (require 'my-nushell-mode)
  (require 'my-org)
  (require 'my-php-mode)
  (require 'my-prog-mode)
  (require 'my-python-mode)
  (require 'my-rest-mode)
  (require 'my-text)
  (require 'my-timers)
  (require 'my-just)
  (require 'my-jj)
  (require 'my-avy)
  (require 'my-registers)

  (require 'my-rust-mode)
  (require 'my-search)
  (require 'my-shells)
  (require 'my-typst)
  (require 'my-terraform-mode)
  (require 'my-vim-mode)

  (provide 'init)
  ;;; init.el ends here
#+end_src

* Utility functions
  This is a collection of random functions I've written to help me run one-off tasks.
  
#+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
  ;; -*- lexical-binding: t; -*-
  (defun find-config ()
    "Open the user's config file."
    (interactive)
    (find-file (concat user-emacs-directory "config.org")))

  (defun masteringemacs ()
    "Open the masteringemacs epub manual."
    (interactive)
    ;; ensure the nov package is installed
    (require 'nov)
    (find-file "~/Dropbox/Emacs/mastering-emacs-v4.epub"))

  (defun add-to-path (value &optional prepend)
    "Add VALUE to the PATH environment variable.

  This handles reading the current value of PATH and appends the given
  value to the end of it, or to the beginning if PREPEND is non nil.

  VALUE should be the raw string to add, `add-to-path' will handle
  ensuring the final value contains the necessary ':'."
    (interactive "DPath: ")
    (let ((path (getenv "PATH")))
  	(setenv "PATH"
  			(concat path value ":"))))

  (provide 'my-util)
#+end_src
* Appearance
** Color theme

The modus theme set is the most complete and polished emacs color
theme I've encountered. It's also WCAG 2 compliant meaning it will
always have high color contrast between UI elements, making it one of
the easiest themes on the eyes in any lighting situation.

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (straight-use-package (car my-theme))
  (load-theme (cdr my-theme) t)
#+end_src

*** Settings
**** Basic theme configuration
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (set-face-attribute 'bold nil :weight 'ultra-bold)
  (when t
    (custom-set-faces
     '(org-level-1 ((t (:height 1.3 :inherit outline-1))))
     '(org-level-2 ((t (:height 1.2 :inherit outline-2))))
     '(org-level-3 ((t (:height 1.2 :inherit outline-3))))
     '(org-level-4 ((t (:height 1.2 :inherit outline-4))))
     '(org-level-5 ((t (:height 1.1 :inherit outline-5))))
     '(org-document-title ((t (:height 2.5 :underline t))))))
#+end_src
**** Modus themes settings
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (when (eq 'modus-themes (car my-theme)) ;; Modus configuration
    (require-theme 'modus-themes)
    (setq modus-themes-completions
  		'((matches . (extrabold underline))
            (selection . (semibold italic))))
    (setq modus-themes-prompts '(bold))
    (setq modus-themes-bold-constructs t)
    (setq modus-themes-common-palette-overrides
  		modus-themes-preset-overrides-intense)
    (setq modus-themes-variable-pitch-ui nil)
    (setq modus-themes-italic-constructs t)
    (setq modus-themes-org-blocks 'gray-background)
    ;; TODO set this to nil if a non-modus theme is active?
    (setq modus-themes-headings
  		'((1 . (1.3))
            (2 . (1.2))
  		  (3 . (1.2))
  		  (4 . (1.2))
            (agenda-date . (1.3))
            (agenda-structure . (variable-pitch light 1.8))
            (t . (1.1)))))
#+end_src
**** Doom themes settings

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (when (eq 'doom-themes (car my-theme))
    (setq doom-rouge-brighter-comments t
  		doom-themes-enable-bold t
  		doom-themes-enable-italic t))
#+end_src

** Tweak display of UI elements
*** Menu bar mode

The menu bar is the list of contextual dropdown options in the top of the
application (or in the universal top bar on macs).

I'm all for getting rid of UI clutter, especially if it's unused, but there
are a lot of features in emacs... Having contextual help aids discoverability,
and so it stays on.
   
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (menu-bar-mode 1)
#+end_src
   
*** Scroll bar mode
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (scroll-bar-mode -1)
#+end_src
*** Tool bar mode
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (tool-bar-mode -1)
#+end_src

** Frame settings
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        inhibit-splash-screen t
        inhibit-startup-screen t)
#+end_src
** Bells are evil
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (setq ring-bell-function 'ignore)
#+end_src
** Time display
*** Format
I like 24 hour time; one time being ambiguous is unnecessarily cumbersome.

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (setq display-time-24hr-format t)
#+end_src

*** Add the time to the mode line

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (display-time)
#+end_src

** Font

I use [[https://www.jetbrains.com/lp/mono/][JetBrains Mono]]

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (set-face-attribute 'default nil
  					:family (plist-get my-font :name)
  					:height (plist-get my-font :size))

  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (let ((size (plist-get my-font :size))
  				  (font (plist-get my-font :name))
  				  (theme (cdr my-theme)))
  			  (with-selected-frame frame
  				(set-face-attribute 'default nil
  									:font font
  									:height size)
  				(set-frame-font font nil t)
  				(add-to-list 'default-frame-alist
  							 `(font . ,font))
  				(load-theme theme t)))))
#+end_src

** Tabs
Tabs are a useful workspace organization concept. You can have discrete window/buffer arrangements per tab,
allowing you to switch between them at will. They are pretty flexible so you could use them for keeping
track of different projects. Or you could have different window configuations for the same set of buffers
on different tabs to help with different types of work within the same project.

#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
   (setq tab-bar-show 1)
#+end_src
** Spacious Padding
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (straight-use-package 'spacious-padding)
#+end_src

** provide the module
#+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
  (provide 'my-appearance)
#+end_src
* Meow mode
** Install and require package
#+begin_src emacs-lisp :tangle "my-modules/my-meow.el" :mkdirp yes
  (straight-use-package 'meow)
  (require 'meow)
#+end_src

** setup the core settings
#+begin_src emacs-lisp :tangle "my-modules/my-meow.el" :mkdirp yes
  (defun meow-setup-core ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty))
#+end_src

** Set up motion state bindings
#+begin_src emacs-lisp :tangle "my-modules/my-meow.el" :mkdirp yes
  (meow-motion-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))
#+end_src

