emacs/.config/emacs/config.org
** Set up all the icons
#+begin_src emacs-lisp :tangle "my-modules/my-icons.el" :mkdirp yes
  ;; Icons
  (straight-use-package 'all-the-icons)
  ;;; If icons aren't showing up, you may need to install the font.
  ;;; If so, uncomment and execute the following line.
  ;; (all-the-icons-install-fonts t)
#+end_src

** And completion support for all the icons

#+begin_src emacs-lisp :tangle "my-modules/my-icons.el" :mkdirp yes
  (straight-use-package 'all-the-icons-completion)
  (all-the-icons-completion-mode)
  (if (require 'marginalia nil nil)
  	(add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup))
#+end_src

** Provide the module

#+begin_src emacs-lisp :tangle "my-modules/my-icons.el" :mkdirp yes
    (provide 'my-icons)
  #+end_src 

* Ediff
** Window management
Ediff puts its control panal in a separate frame, which makes tiling window managers
quite unhappy. Let's configure it to use the /plain/ setup which just makes a small
window at the bottom of the current frame.
   
#+begin_src emacs-lisp :tangle "my-modules/my-ediff.el" :mkdirp yes
  (require 'ediff)
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
  (setq ediff-split-window-function 'split-window-horizontally)
#+end_src

** Provide =my-ediff=
#+begin_src emacs-lisp :tangle "my-modules/my-ediff.el" :mkdirp yes
  (provide 'my-ediff)
#+end_src
  
* Getting Things Done (GTD)
#+begin_src emacs-lisp :tangle "my-modules/my-gtd.el" :mkdirp yes
  (defvar gtd-directory (expand-file-name "~/Dropbox/org/gtd")
    "The directory my 'Getting Things Done' system is stored in")

  (defun gtd-find-oneoff ()
    "Open GTD one off file."
    (interactive)
    (find-file (concat gtd-directory "/oneoff.org")))

  (defun gtd-find-schedule ()
    "Open GTD schedule file."
    (interactive)
    (find-file (concat gtd-directory "/schedule.org")))

  (defun gtd-find-inbox ()
    "Open GTD inbox file."
    (interactive)
    (find-file (concat gtd-directory "/inbox.org")))

  (defun gtd-review ()
    "Review inbox and all tasks for clarification and pruning."
    (interactive)
    (delete-other-windows)
    (gtd-find-inbox)
    (split-window-right)
    (org-agenda nil "g"))

  (defun gtd-engage ()
    "Actually get some work done.

  Opens the \"daily\" custom org agenda command."
    (interactive)
    (org-agenda nil "d"))

  (defun gtd-capture ()
    "Capture a thought and store in my gtd inbox."
    (interactive)
    (org-capture nil "i"))

  (provide 'my-gtd)
#+end_src
* Denote
** Basic settings
#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'denote)

  (denote-rename-buffer-mode 1)
  (setq denote-known-keywords '("emacs" "work" "article" "notes" "blog"))

  (setq denote-directory (expand-file-name "~/Dropbox/org/zettelkasten"))

  (setq denote-dired-directories-include-subdirectories t
        denote-dired-directories (list denote-directory))
  (setq denote-prompts '(title subdirectory keywords))
#+end_src

** Bindings

#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  ;;; Code:
  (defun denote-recently-modified (&optional last-days)
    "View a `dired' buffer containing notes modified in the last LAST-DAYS days.

  This uses the first element of `denote-directories' to determine where notes are stored."
    (interactive (list
                  (read-number "Last days: " 7)))
    (let* ((default-directory (car (denote-directories)))
           ;; find files recently modified and sort by modification time
           (find-command (format "find . -type f -mtime -%d ! -name .DS_Store | xargs ls -t | cut -c3-"
                                 last-days))
           (files (split-string
                   (shell-command-to-string find-command))))
      (dired (cons default-directory files))))
#+end_src

** Journaling
#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'denote-journal)
  (setq denote-journal-directory (concat denote-directory "/journal"))
  (add-to-list 'denote-dired-directories denote-journal-directory)
  ;; calendar integration
  (require 'denote-journal)
  (add-hook 'calendar-mode-hook #'denote-journal-calendar-mode)
#+end_src

** Silos
Silos are a way to fully sepparate notes from each other. In order
to fully support them, we'll need to tell denote where each silo
lives.

#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'denote-silo)
  ;; (setq denote-silo-directories '())
  ;; (let ((my-silo-dirs (mapcar (lambda (file)
  ;;                               (expand-file-name file))
  ;;                             '("~/Dropbox/org/gtd/projects"))))
  ;;   (dolist (dir my-silo-dirs)
  ;;     (add-to-list 'denote-silo-directories dir)
  ;;     (add-to-list 'denote-dired-directories dir)))
#+end_src

** Hooks
#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
#+end_src

** Org integration
#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'denote-org)
#+end_src

** Sequences
Denote has optional support for sequences of notes, making
hierarchical series of notes with parent, child, sibling
relationships.

This sequence information is encoded in the denote [[denote:20231121T144329][File Naming Scheme]]
in the [[denote:20231205T093346][signature]] section.

#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'denote-sequence)
#+end_src
** Denote Explore
Denote explore is a great little package that supplies some helper
function meant to aid in managing your denote notes.

It is separated into four categories:

1. statistical information about your notes
2. random walks to help spur creative thinking about your notes
3. janitorial tasks to organize and clean up your notes
4. visualization methods to see the relationships between your notes

see [[info:denote-explore][here]] for a full manual on the package

#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'denote-explore)
#+end_src

** Consult Denote
#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (straight-use-package 'consult-denote)
  (consult-denote-mode 1)
#+end_src
** Templates
Denote allows for defining templates when creating a new note. The
selected template will pre-fill the newly created note.

#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (setq denote-templates
        `((onboarding . ,(concat "* Onboarding Tasks\n"
                                 "  - [ ] Welcome, office tour\n"
                                 "  - [ ] Get laptop (Ada)\n"
                                 "  - [ ] Kipsu Platform Architecture\n"
                                 "    - https://kipsudev.atlassian.net/wiki/spaces/EN/pages/3145105581/-+Architecture\n"
                                 "  - [ ] Set up local environment\n"
                                 "  - [ ] Get peripherals\n"
                                 "  - [ ] PagerDuty Access\n"
                                 "  - [ ] Account access\n"
                                 "    - AUDIT ticket\n"
                                 "    - github\n"
                                 "    - aws\n"
                                 "    - jira\n"
                                 "    - confluence"))
          (journal . ,(concat "* Daily habits\n"
                              "  - [[denote:20250423T155338][Be Still and Wonder]]\n"
                              "  - [[https://github.com/issues/SSC_kgDOABqApA?q=is%3Apr%20org%3AKipsu%20state%3Aopen%20archived%3Afalse%20sort%3Aupdated-desc%20-is%3Adraft%20review-requested%3A%40me][review pull requests]]\n\n"
                              "* Notes\n"))
          (person . ,(concat "* Relationships\n\n"
                             "* Prayer requests\n\n"
                             "* Meetings\n"))))
#+end_src
** Provide the module
#+begin_src emacs-lisp :tangle "my-modules/my-denote.el" :mkdirp yes
  (provide 'my-denote)
#+end_src

* Dired

The Dir(ectory) Ed(itor). [[elisp:(info "(emacs) Dired")][Dired]] is a text based file manager, baked into
emacs. It uses the modest [[man:ls][ls]] command to generate the directory listing,
and adds a ton of functionality on top, allowing for inteligent commands
to operate on the seleted file(s). This only scratches the surface of
what it can do, so seriously, read the info doc.

** Settings

#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (setq dired-kill-when-opening-new-dired-buffer t) 
  (require 'dired)
  (setq dired-listing-switches "-hAl")
  ;; this pre-fills the destination prompt of copy and rename
  ;; commands with the directory of the other dired buffer
  ;; if one is open. Very handy
  (setq dired-dwim-target t)

  ;; don't show all the file details by default
  ;; They're still accessible with '('
  (add-hook 'dired-mode-hook 'dired-hide-details-mode)
#+end_src

I want to be able to toggle the display of dotfiles in dired. This function allows me to
do exactly that.

#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (defun dired-dotfiles-toggle ()
    (interactive)
    (when (equal major-mode 'dired-mode)
      (if (or (not (boundp 'dired-dotfiles-show-p)) dired-dotfiles-show-p)
          (progn
            (set (make-local-variable 'dired-dotfiles-show-p) nil)
            (message "h")
            (dired-mark-files-regexp "^\\\.")
            (dired-do-kill-lines))
        (progn (revert-buffer)
               (set (make-local-variable 'dired-dotfiles-show-p) t)))))

  (keymap-set dired-mode-map "." #'dired-dotfiles-toggle)

  (defun dired-mark-files-extension (extension)
    "Mark all files with the given file EXTENSION.

   EXTENSION should not contain the . prefix.
   When called interactively, derive the extension from the current file
   under the point in the dired buffer."
    (interactive
     (list (if current-prefix-arg
               (read-string "Extension: ")
             (file-name-extension (dired-get-filename))))
     'dired-mode)
    (dired-mark-files-regexp (concat "." extension "$")))
#+end_src
** Bindings

#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (keymap-set dired-mode-map "K" #'dired-do-kill-lines)
  (keymap-set dired-mode-map "h" #'dired-up-directory)
  (keymap-set dired-mode-map "l" #'dired-find-file)
  (defun dired-go-home ()
    (interactive)
    (dired-jump nil "~/"))
  (keymap-set dired-mode-map "~" #'dired-go-home)
#+end_src

** Helper functions
  
#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (defun dired-first-file ()
    "Jump the point to the first dired entry that isn't . or .."
    (interactive)
    (beginning-of-buffer)
    (dired-next-line 1))

  (defun dired-last-file ()
    "Jump the point to the last dired entry."
    (interactive)
    (end-of-buffer)
    (dired-next-line -1))

#+end_src

** dired-preview

sometimes it's handy to preview the file under point as you're navigating
a directory. dired-preview allows for exactly this behavior.

#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (straight-use-package 'dired-preview)
  (setq dired-preview-delay 0.2)
  #+end_src

** Icons

#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (straight-use-package 'all-the-icons-dired)
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
  (setq all-the-icons-dired-monochrome nil)
#+end_src

** Provide the module

#+begin_src emacs-lisp :tangle "my-modules/my-dired.el" :mkdirp yes
  (provide 'my-dired)
#+end_src
  
* GPG (egp)

GPG allows you to easily encrypt/decrypt files with either symmetric
(shared key) or asymetric (private key) encryption.

Emacs hooks into this seemlessly by automatically decrypting encrypted
files automatically when opening them using any loaded encyption keys
you have on the system.

** Disable waiting for status

There is an outstanding bug in epg where waiting for the enryption status
will hang, which blocks the whole editor. We can disable this for now.

#+begin_src emacs-lisp :tangle "my-modules/my-gpg.el" :mkdirp yes
  (fset 'epg-wait-for-status 'ignore)
#+end_src

** PIN entry

PIN entry is used to authorize a gpg key for use. By default emacs will
reach out to an external proccess to prompt for the PIN. But this is
emacs, let's make emacs do it.

#+begin_src emacs-lisp :tangle "my-modules/my-gpg.el" :mkdirp yes
  (setq epg-pinentry-mode 'loopback)
#+end_src

** Provide the module
  
#+begin_src emacs-lisp :tangle "my-modules/my-gpg.el" :mkdirp yes
  (provide 'my-gpg)
#+end_src

* Http server (simple-httpd)
This allows emacs to spin up a local http server to serve local
files on the filesystem.

