emacs/.config/emacs/config.org
** Add the package
#+begin_src emacs-lisp :tangle "my-modules/my-http.el" :mkdirp yes
  (straight-use-package 'simple-httpd)
#+end_src

** Provide the module

#+begin_src emacs-lisp :tangle "my-modules/my-http.el" :mkdirp yes
  (provide 'my-http)
#+end_src

* Epub support
** Load nov mode and associate it with .epub files
#+begin_src emacs-lisp :tangle "my-modules/my-epub.el" :mkdirp yes
  (straight-use-package 'nov)
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src

** Provide the module
#+begin_src emacs-lisp :tangle "my-modules/my-epub.el" :mkdirp yes
  (provide 'my-epub)
#+end_src

* Feed reader
We use the wonderful `elfeed` package to track and read feeds.

#+begin_src emacs-lisp :tangle "my-modules/my-feed.el" :mkdirp yes
  (straight-use-package 'elfeed)
  (setq elfeed-feeds
        '(("https://protesilaos.com/codelog.xml" code emacs)
          ("http://rss.desiringgod.org/" christianity)
          ("https://karthinks.com/index.xml" emacs)
          ("https://www.thegospelcoalition.org/feed/" christianity)
          ("https://www.firstthings.com/rss/web-exclusives" christianity)
  		("https://irreal.org/blog/?feed=rss2" emacs)))

  (provide 'my-feed)
#+end_src
    
* Programming
#+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
  (setq-default tab-width 4)
#+end_src
** Prog mode
Emacs has a general ~prog~ mode, serving as the base major mode for
all language specific programming modes. Adding settings and hooks
for this mode means they will be set for all programming languages.

*** Rainbow delimiters
   
Highlight netsted delimeters with unique colors so you can tell
at a glance how deep you are.


#+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
  (straight-use-package 'rainbow-delimiters)
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+end_src

*** LSP (Language Server Protocol)
#+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
  (straight-use-package 'lsp-mode)
  (straight-use-package 'lsp-ui)
#+end_src
*** Eglot

   Language server client implimentation. Comes baked into emacs starting
   at version 29.

   There seems to be a bug with the latest version of `menu-bar' (maybe?
   or perhaps in `project'?)

   Eglot attempts to insert itself info the menu bar, but the project
   entry in the menu bar is not defined. Setting this variable to ~nil~
   resolves the immediate issue causing ~eglot~ to crash. It is unknown
   what downstream ramifications this actually causes.

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (defvar menu-bar-project-menu '())
   #+end_src

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (add-hook 'eglot-managed-mode-hook
               (lambda ()
                 (setq eldoc-documentation-strategy #'eldoc-documentation-compose)
                 (setq eldoc-documentation-functions
                       '(eglot-signature-eldoc-function
                         eglot-hover-eldoc-function))))
   #+end_src

   And for support for languages that aren't pre-configured out of
   the box by eglot:

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (with-eval-after-load 'eglot
       (add-to-list 'eglot-server-programs
		    `(terraform-mode . ("terraform-ls" "serve"))))
   #+end_src

*** Highlight TODO statements

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (straight-use-package 'hl-todo)
     (global-hl-todo-mode 1)
   #+end_src
*** Electric pair mode
   This is a fairly simple mode that automatically inserts the matching symbol. =)= after typing =(=
   for instance.

   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (electric-pair-mode 1)
   #+end_src
*** Provide =my-prog-mode=
   #+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
     (provide 'my-prog-mode)
   #+end_src
    
** Flycheck (error checking)
This replaces the venerable, but outdated flymake.

#+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
  ;; need to set some flymake variable that aparently needs to be in scope
  (setq flymake-allowed-file-name-masks nil)
  (straight-use-package 'flycheck)
  (global-flycheck-mode 1)
#+end_src

** Flyover (inline diagnostics)
#+begin_src emacs-lisp :tangle "my-modules/my-prog-mode.el" :mkdirp yes
  ;; (straight-use-package '(flyover
  ;;                         :type git
  ;;                         :host github
  ;;                         :repo "konrad1977/flyover"))
  ;; (add-hook 'flycheck-mode-hook #'flyover-mode)
  ;; (setq flyover-levels '(error warning info))
#+end_src

** Tree Sitter
*** Overview
    Tree sitter allows for parsing structured text formats into an
    abstract syntax tree. From there, it provides language agnostic
    methods to find and modify the AST. Having the parse tree allows
    for far more consistent and robust syntax highlighting, but beyond
    that, it will allow for structured text editing which operates at
    the level of syntactical objects rather than characters.

*** Install the package
    #+begin_src emacs-lisp :tangle "my-modules/my-tree-sitter.el" :mkdirp yes
      (straight-use-package 'tree-sitter)
      (straight-use-package 'tree-sitter-indent)
      (straight-use-package 'tree-sitter-langs)
    #+end_src

*** Install languages
    #+begin_src emacs-lisp :tangle "my-modules/my-tree-sitter.el" :mkdirp yes
      (setq treesit-language-source-alist
	    '((rust "https://github.com/tree-sitter/tree-sitter-rust")
	      (typst "https://github.com/uben0/tree-sitter-typst")))

      (setq treesit-load-name-override-list '((rust "libtree-sitter-rust" "tree_sitter_rust")))
    #+end_src

*** Enable global tree sitter mode
    #+begin_src emacs-lisp :tangle "my-modules/my-tree-sitter.el" :mkdirp yes
      (global-tree-sitter-mode)
      (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
    #+end_src

*** Provide the module
    #+begin_src emacs-lisp :tangle "my-modules/my-tree-sitter.el" :mkdirp yes
      (provide 'my-tree-sitter)
    #+end_src
** Rest mode
   Run http commands using simple http spec

   #+begin_src emacs-lisp :tangle "my-modules/my-rest-mode.el" :mkdirp yes
     (straight-use-package 'restclient)
     (add-to-list 'auto-mode-alist '("\\.http\\'" . restclient-mode))
     (provide 'my-rest-mode)
   #+end_src
 
** Docker support
*** Dockerfile mode

#+begin_src emacs-lisp :tangle "my-modules/my-docker-mode.el" :mkdirp yes
  (straight-use-package 'dockerfile-mode)
#+end_src
*** docker integration

This package allows for intuitive, magit-like interaction with docker:
images, containers, compose, and more.

 #+begin_src emacs-lisp :tangle "my-modules/my-docker-mode.el" :mkdirp yes
   (straight-use-package 'docker)
   (keymap-global-set "C-c d" #'docker)
 #+end_src

*** Provide the module
 #+begin_src emacs-lisp :tangle "my-modules/my-docker-mode.el" :mkdirp yes
   (provide 'my-docker-mode)
 #+end_src

** Lisp modes
*** Indentation
   #+begin_src emacs-lisp :tangle "my-modules/my-lisp-mode.el" :mkdirp yes
     (straight-use-package 'aggressive-indent)
     (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
     (provide 'my-lisp-mode)
   #+end_src
** Markup languages
*** Markdown
   #+begin_src emacs-lisp :tangle "my-modules/my-markup.el" :mkdirp yes
     (straight-use-package 'markdown-mode)
   #+end_src

*** Json
   #+begin_src emacs-lisp :tangle "my-modules/my-markup.el" :mkdirp yes
     (straight-use-package 'json-mode)
   #+end_src

*** Yaml 
   #+begin_src emacs-lisp :tangle "my-modules/my-markup.el" :mkdirp yes
     (straight-use-package 'yaml-mode)
     (add-to-list 'auto-mode-alist '("\\.ya?ml\\'" . yaml-ts-mode))
   #+end_src
*** Json
   #+begin_src emacs-lisp :tangle "my-modules/my-markup.el" :mkdirp yes
     (straight-use-package 'json-mode)
   #+end_src
*** Provide =my-markup=
   #+begin_src emacs-lisp :tangle "my-modules/my-markup.el" :mkdirp yes
     (provide 'my-markup)
   #+end_src
** Terraform 
*** Install the package
   #+begin_src emacs-lisp :tangle "my-modules/my-terraform-mode.el" :mkdirp yes
     ;; -*- lexical-binding: t; -*-
     (straight-use-package 'terraform-mode)
     (provide 'my-terraform-mode)
   #+end_src

*** Settings
   #+begin_src emacs-lisp :tangle "my-modules/my-terraform-mode.el" :mkdirp yes
     (setq terraform-format-on-save t)
   #+end_src

*** Bindings
   #+begin_src emacs-lisp :tangle "my-modules/my-terraform-mode.el" :mkdirp yes
     (defun terraform-init ()
       (interactive)
       (compile "terraform init"))

     (defun terraform-plan ()
       (interactive)
       (compile "terraform plan"))

     (defun terraform-apply ()
       (interactive)
       (compile "terraform apply"))
   #+end_src

*** Provide my-terraform
   #+begin_src emacs-lisp :tangle "my-modules/my-terraform-mode.el" :mkdirp yes
     (provide 'my-terraform-mode)
   #+end_src

** PHP

   Configure eglot to use inteliphense

   *This doesn't work currently. not sure what's wrong with intelephense*
   #+begin_src emacs-lisp :tangle "my-modules/my-php-mode.el" :mkdirp yes
     ;; (with-eval-after-load 'eglot
     ;;   (add-to-list 'eglot-server-programs
     ;;	    '(php-mode . ("intelephense" "--stdio"))))
     (straight-use-package 'php-mode)
     (provide 'my-php-mode)
   #+end_src

** Python
*** Pipfile support
    #+begin_src emacs-lisp :tangle "my-modules/my-python-mode.el" :mkdirp yes
      (add-to-list 'auto-mode-alist '("Pipfile" . conf-toml-mode))
    #+end_src
*** Provide =my-python-mode=
    #+begin_src emacs-lisp :tangle "my-modules/my-python-mode.el" :mkdirp yes
      (provide 'my-python-mode)
    #+end_src

** Rust
   #+begin_src emacs-lisp :tangle "my-modules/my-rust-mode.el" :mkdirp yes
     (straight-use-package 'rust-mode)
     (setq rust-format-on-save t)
     (add-hook 'rust-mode-hook
     		  (lambda () (prettify-symbols-mode)))
     (provide 'my-rust-mode)
   #+end_src

** Vimrc

  This adds syntax highlighting for the random times I'll need to edit
  a vimrc-esque file from emacs.

  #+begin_src emacs-lisp :tangle "my-modules/my-vim-mode.el" :mkdirp yes
    ;; -*- lexical-binding: t; -*-

    (straight-use-package 'vimrc-mode)
    (provide 'my-vim-mode)
  #+end_src

** Nushell
   This adds support for nushell files

   #+begin_src emacs-lisp :tangle "my-modules/my-nushell-mode.el" :mkdirp yes
     (straight-use-package 'nushell-mode)
     (provide 'my-nushell-mode)
   #+end_src
** Golang
   #+begin_src emacs-lisp :tangle "my-modules/my-go-mode.el" :mkdirp yes
     (straight-use-package 'go-mode)
     (setq gofmt-command "/usr/local/go/bin/gofmt")
     (setenv "PATH"
             (concat
              "/usr/local/go/bin:"
              "/Library/TeX/texbin:"
              "/opt/homebrew/bin:"
              (getenv "PATH")))
     (defun my-go-mode-hook ()
       (when (eq major-mode 'go-mode)
         (gofmt-before-save)))
     (add-hook 'before-save-hook #'my-go-mode-hook)
     (provide 'my-go-mode)
   #+end_src
** Neon mode
Neon mode is mostly just yaml.

#+begin_src emacs-lisp :tangle "my-modules/my-neon-mode.el" :mkdirp yes
  (straight-use-package 'neon-mode)
  (provide 'my-neon-mode)
#+end_src
* Org

  What is org mode? What /isn't/ org mode? Built on top of emacs' outline-mode, org mode
  poorly documented extras, but all baked in and then some) It can make headings, lists,
  emphasize text, store links to other headings in the same or different files and so
  much more.

  In addition to note taking, it handles thinks like task tracking, scheduling, effortless
  ascii table editing, embedded runnable code snippets (think Jupyter notebooks).

  In fact, this emacs configuration is written in org mode, and the embedded emacs lisp
  is extracted and ran to formulate the actual config.

  #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
    (straight-use-package '(org :type built-in))
    (require 'org)
  #+end_src

** modules
   As if org wasn't useful enough as it was, it also ships with a bunch of
   additional modules that add additional features. Check it out by looking
   at the customize-option for [[elisp:(customize-option 'org-modules)][org-modules]]. One useful one added here is
   the ~man~ module, which provides support for linking to man pages (opened
   in emacs' built in man page viewer, obviously)

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (with-eval-after-load 'org
       (require 'ol-man)
       (add-to-list 'org-modules 'ol-man t)
       (add-to-list 'org-modules 'org-habit t))
   #+end_src

** Settings
*** org tempo
    Org tempo does a lot, I should really look into more of what it has to offer.
    At the very least, I use it for really handy expansion for scr blocks.
    I can type =<s= and hit =TAB= to expand it to =#+begin_src=.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (with-eval-after-load 'org
       (require 'org-tempo))
   #+end_src

*** default files and directories

   These are a handful of settings that set up default destinations for actions that
   act globally, such as [[*Org capture][org-capture]].

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-directory "~/Dropbox/org/gtd/")
     (setq org-default-notes-file "~/Dropbox/org/gtd/gtd.org")
   #+end_src

*** todo statuses

   Setting todo states
   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-todo-keywords
           '((sequence
              "TODO(t)"
              "NEXT(n)"
              "WAIT(w)"
              "STRT(s)"
              "BLOCKED(b)"
              "REVIEW(r)"
              "|"
              "DONE(d)"
     		 "CANCELED(c)")))
   #+end_src
   
*** images

   When inserting images in org files, often they will be way to large to fit into
   the general flow of the document. Through the use of ~#+attr_html: :width NNpx~,
   you cen set how large the image should be displayed as. To enable this, we will
   need to turn off the following setting.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-image-actual-width nil)
   #+end_src

*** indentation

   messing with org src block indentation

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-src-preserve-indentation nil)
     (setq org-startup-indented t)
     (straight-use-package
      '(org-modern-indent
        :type git
        :host github
        :repo "jdtsmith/org-modern-indent"))
     (require 'org-modern-indent)
     (add-hook 'org-mode-hook #'org-modern-indent-mode 90)
   #+end_src

*** display settings
   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-hide-emphasis-markers t)
   #+end_src

*** Priority

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-priority-highest ?A
     	  org-priority-lowest ?D)
   #+end_src

