emacs/.config/emacs/my-modules/my-org.el
(straight-use-package '(org :type built-in))
(require 'org)

(with-eval-after-load 'org
  (require 'ol-man)
  (add-to-list 'org-modules 'ol-man t)
  (add-to-list 'org-modules 'org-habit t))

(with-eval-after-load 'org
  (require 'org-tempo))

(setq org-directory "~/Dropbox/org/gtd/")
(setq org-default-notes-file "~/Dropbox/org/gtd/gtd.org")

(setq org-todo-keywords
      '((sequence
         "TODO(t)"
         "NEXT(n)"
         "WAIT(w)"
         "STRT(s)"
         "BLOCKED(b)"
         "REVIEW(r)"
         "|"
         "DONE(d)"
		 "CANCELED(c)")))

(setq org-image-actual-width nil)

(setq org-src-preserve-indentation nil)
(setq org-startup-indented t)
(straight-use-package
 '(org-modern-indent
   :type git
   :host github
   :repo "jdtsmith/org-modern-indent"))
(require 'org-modern-indent)
(add-hook 'org-mode-hook #'org-modern-indent-mode 90)

(setq org-hide-emphasis-markers t)

(setq org-priority-highest ?A
	  org-priority-lowest ?D)
