emacs/.config/emacs/config.org
*** export
Org can export content into a variety of formats.  Most relevant to my
purposes is LaTeX/pdf.  What follows are various settings specific to
configuring the environment for exporting org documents into TeX and
then into pdfs

#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
  ;; for handling CSL citation languages in org exporting to latex
  (straight-use-package 'citeproc)

  ;; use latexmk for generating pdfs from tex files
  (setq org-latex-pdf-process '("LC_ALL=en_US.UTF-8 latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o %f"))
#+end_src

With the ~ox-typst~ package, org can export to typst documents.

#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
  (with-eval-after-load 'org
    (straight-use-package 'ox-typst)
    (require 'ox-typst))
#+end_src


** Org agenda
*** Custom commands
    These commands show up in the org-agenda view and will produce
    lists of org headings matching a variety of criteria.
#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
  (setq org-agenda-custom-commands
  	  '(("g" "GTD Review"
  		 ((tags "+proj+LEVEL=2"
  				((org-agenda-overriding-header "Active Projects")))
  		  (todo "STRT"
  				((org-agenda-overriding-header "In Progress")))
  		  (todo "WAIT|REVIEW|BLOCKED"
  				((org-agenda-overriding-header "Waiting...")))
  		  (todo "NEXT"
  				((org-agenda-overriding-header "Next Actions")))
  		  (tags "+DEADLINE=\"\"+SCHEDULED=\"\"+TODO=\"TODO\"|TODO=\"WAIT\""
  				((org-agenda-overriding-header "Inactive tasks")))))

  		("d" "GTD Daily View"
  		 ((agenda ""
  				  ((org-agenda-overriding-header "Today")
  				   (org-agenda-span 1)))
  		  (todo "STRT"
  				((org-agenda-overriding-header "In Progress")))
  		  (todo "WAIT|REVIEW|BLOCKED"
  				((org-agenda-overriding-header "Waiting...")))
  		  (todo "NEXT"
  				((org-agenda-overriding-header "Next Actions")))))))
#+end_src

*** agenda view settings
#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
	(setq org-agenda-time-grid
		  '((daily today require-timed remove-match)
			(800 1000 1200 1400 1600 1800 2000)
			"  "
			""))
#+end_src

*** Stuck projects

A stuck project is a project which has no identified "next"
action on it. Using my "getting things done" system, this means a
project is one which has the tag "proj" and a task with the
"NEXT" or "STRT" todo state.

#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
  (setq org-stuck-projects
		'("+proj-archive+LEVEL=1/-DONE" ("NEXT" "STRT") nil ""))
#+end_src

*** basic settings
    Org agenda is cool. It tries to create a day/week/month planner out of any tasks
    or scheduled events it can find in `org-agenda-files'.

    I want it to pull in appointments or reminders from the diary as well since
    those sorts of events don't really make sense to track in org.

    This will cause emacs to save all the associated buffers attached
    to the headings shown in the agenda buffer.

    #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
      (advice-add 'org-agenda-quit :before 'org-save-all-org-buffers)
    #+end_src

*** Refile targets

#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
  (setq org-refile-targets
  	  '((org-agenda-files . (:regexp . "One Off"))
  		(org-agenda-files . (:regexp . "Events"))
  		(org-agenda-files . (:regexp . "Someday"))
  		(org-agenda-files . (:tag . "proj"))))
#+end_src

*** Tag list

These tags allow you to select from a list of these predefined tags
using single-key shortcuts (if provided) to toggle tags from a
heading.

#+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
  (setq org-tag-alist
        '((:startgroup)
          ("proj" . ?p)
          ("area" . ?a)
          (:endgroup)

          ;; mental/emotional level
          (:startgroup)
          ("@lowenergy" . ?l)
          ("@highenergy" . ?h)
          (:endgroup)

          ;; locations
          (:startgroup)
          ("@Church" . ?C)
          ("@Work" . ?W)
          ("@Transit" . ?T)
          ("@Home" . ?H)
          ("@Anywhere" . ?A)
          ("@Outsize" . ?O)
          (:endgroup)

          ;; devices
          (:startgroup)
          ("@Laptop" . ?L)
          ("@Phone" . ?P)
          (:endgroup)))

  (setq org-agenda-include-diary t)
  (setq org-agenda-restore-windows-after-quit t)
  (setq org-agenda-skip-deadline-if-done t
        org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-category-icon-alist nil)
  (setq org-columns-default-format "%TODO %3PRIORITY %45ITEM %16SCHEDULED %TAGS")
  (add-to-list 'org-agenda-category-icon-alist
               '(".*" '(space . (:width (18)))))

  (add-to-list 'org-agenda-files org-directory)
#+end_src

*** super agenda
    NOTE: this package recipe appears to be broken
    currently. Something about the version of org is wrong.

	*NOTE*: Maybe since I pinned the org version to the local one this
     should work better?
    #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
      ;; (straight-use-package 'org-super-agenda)
      ;; (setq org-super-agenda-groups
      ;; '(
      ;; 	(:name "Today"
      ;; 	       :time-grid t
      ;; 	       :todo '("TODO" "WORKING"))))
    #+end_src

** Org capture

   Org capture aids you in jotting down a quick note when you think of somethimg
   you want to remember but don't want to lose momentum in whatever task you
   were in the middle of.

   Say you were writing a new feature in an application and you realize there's
   a possibility to refactor an adjacent part of the code. Run org capture
   M-x [[help:org-capture][org-capture]] and a temporary buffer opens up where you can take your
   note. It will automatically embed any contextual information about where
   you took the note from, such as which file you were editing, the time,
   etc. Once you finish the note, close the buffer with ~C-c C-c~ and the note
   is gone, the window closes and you're back to doing what you were doing
   before.

   Behind the scenes ~org-capture~ stored your note in the file of your choosing
   for you to review on your own time when convenient.

   You can customize what types of notes ~org-capture~ can take, so that you can
   capture any any data you want, place it into any file you want. Just customize
   the variable ~org-capture-templates~.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-capture-templates
     	  `(("i" "Inbox   - things that may need attention later" entry (file "~/Dropbox/org/gtd/inbox.org")
              "* %?\n/Entered on/ %U")
     		("p" "Project - new project" entry
     		 (file+headline org-default-notes-file "Projects")
     		 "* %^{project title} %(org-set-tags \"proj\")\n** Notes\n\n** Tasks\n*** TODO %?")))
   #+end_src

** Org structures
   Org supports a variety of /structures/. In context, a structure is a block of
   content. Structures can contain source code, comments, quotes, examples, and
   more.

   This can be extended through ~org-structure-template-alist~.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (setq org-structure-template-alist
           '(("s" . "src")
             ("e" . "src emacs-lisp")
             ("b" . "src bash")
     		("q" . "quote")
             ("t" . "src emacs-lisp :tangle FILENAME :mkdirp yes")))
   #+end_src
** Org publish

   Org allows you to export any org file to a variety of formats:
     - markdown
     - iCalendar (for scheduled/deadline events)
     - ODT (or word if configured) documents
     - plain text (using unicode or ascii elemets)
     - html

   Beyond this however, you can configure org to publish a whole collection
   of org files into a viewable site. It will configure links, css, and more
   for you. You just need to configure the projects variable

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (require 'ox-publish)

     (setq org-publish-use-timestamps-flag nil)

     ;; Don't show validation link
     (setq org-html-validation-link nil)
     ;; Use our own scripts
     (setq org-html-head-include-scripts nil)
     ;; Use our own styles
     (setq org-html-head-include-default-style nil)

     ;; this allows us to get syntax highlighting in source blocks exported to html
     (straight-use-package 'htmlize)

     (setq org-publish-project-alist
       (list (list "blog"
               :components (list "blog-org" "blog-static"))
         (list "blog-org"
               :base-directory "~/blog/org"
               :publishing-directory "~/blog/public"
               :auto-sitemap nil
               :recursive t
               :with-broken-links t
                       :with-creator t
               :section-numbers nil
               :exclude "README"
               :export-exclude-tags (list "draft")
               :with-author "Jon Harder"
               :with-toc nil
               :html-htmlize-output-type 'inline-css
               :html-doctype "html5"
               :html-html5-fancy t
               :html-preamble nil
               :html-postamble nil)
         (list "blog-static"
               :base-directory "~/blog/org/"
               :base-extension "css\\|ico\\|png\\|jpg\\|jpeg\\|gif"
               :publishing-directory "~/blog/public/"
               :recursive t
               :publishing-function #'org-publish-attachment)))
   #+end_src

** Visual enhancements

*** Emphasis markers

    Hide the markers which annotate different emphasis indicators in text.

    #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
      (setq org-hide-emphasis-markers t)
    #+end_src

*** Org Modern

~org-modern~ uses emacs built-in text properties to style org elements
in a beautiful way. It incapsulates ~org-bullets~ and thus that
package is disabled.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (straight-use-package 'org-modern)
     (with-eval-after-load 'org (global-org-modern-mode))
   #+end_src

