emacs/.config/emacs/config.org
** Babel

   Org babel is a code embedding feature. It comes included in the default
   install of Org (which itself comes with emacs core).

   Every emacs-lisp block in this file is written in a source block that
   babel will evaluate to form the actual, runnable config.

   This is how [[file:init.el][init.el]] can be just one sexp; telling babel to untangle
   this file in order to extract all the elisp.

   It's far more powerfull than that though, as it allows for [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]]
   in the style of Jupyter notebooks. You can execute a bash script, record the
   results, then feed that data into a python script and export that into an org
   table. This is a huge boon to reproducible research, and documenting processes.

   In order to execute code snippets in an org buffer, that language must be supported
   and enabled. By default, org only authorizes emacs-lisp, but this can be easily
   changed using ~org-bable-do-load-languages~. Your language of choice might not be
   supported out of the box, even if you add it using ~org-babel-do-load-languages~;
   if this is the case, you'll need to load a third-party package to support it.
   These are typically called =ob-$LANG=. For example, to support executing haskell,
   you must install the package =ob-haskell=.

*** Enabling more languages

     #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
       (org-babel-do-load-languages
        'org-babel-load-languages
        '((emacs-lisp . t)
          (python . t)
          (calc . t)
          (shell . t)))
     #+end_src

** toc-org

   Toc org is a package that dynamically generates and maintains a table
   of contents within org documents.

   All you need to do is annotate any heading with ~:TOC:~ and the plugin
   will highjack that heading for use on save.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (straight-use-package 'toc-org)
     (add-hook 'org-mode-hook 'toc-org-mode)
#+end_src

** Literate calc mode
   Literate calc mode evaluations equations inline in your buffer and
   prints the results as overlays in the file.

   Using its minor mode in org results in a really ergonomic
   experience with hashing out quick equations.

   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (straight-use-package 'literate-calc-mode)
     (add-hook 'org-mode-hook #'literate-calc-minor-mode)
   #+end_src
   
** Provide =my-org=
   #+begin_src emacs-lisp :tangle "my-modules/my-org.el" :mkdirp yes
     (provide 'my-org)
   #+end_src
* Jujutsu (jj)
   Jujutsu in a simple, but powerful version control system. It's
   great. It uses git as the backing change database (though a native,
   novel storage backend is in the works) so it can be seamlessly used
   in a git based project and even used alongside with other
   contributors who are still using git directly.

   #+begin_src emacs-lisp :tangle "my-modules/my-jj.el" :mkdirp yes
     (straight-use-package
      '(jj-mode :type git
                :host github
                :repo "bolivier/jj-mode.el"))
     (require 'magit)
     (provide 'my-jj)
   #+end_src
* Search
** Isearch
    There are a variety of entrypoints into emacs' built in searching
    facilities.

    The most basic and straightforward is ~isearch-forward~, bound to
    =C-s= by default.

*** Settings
     #+begin_src emacs-lisp :tangle "my-modules/my-search.el" :mkdirp yes
       ;; -*- lexical-binding: t; -*-
       (setq isearch-lazy-count t
             lazy-count-prefix-format "(%s/%s) "
             lazy-count-suffix-format nil)
     #+end_src
** Provide =my-search= module
   #+begin_src emacs-lisp :tangle "my-modules/my-search.el" :mkdirp yes
     (provide 'my-search)
   #+end_src

* Shells
** Basic config

   This sets which shell to use when executing commands from dired or compile and friends
   This is different from the shell to use in interactive sessions.

   Because I use [[https://www.nushell.sh][nushell]] for my shell, regular commands like [[man:find][find]] often choke when tools
   like dired assume the posix implementation.

   #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
     ;; -*- lexical-binding: t; -*-
     (setq explicit-shell-file-name "/opt/homebrew/bin/nu"
           shell-file-name "/bin/zsh")
   #+end_src

** Eshell
*** Environment variables
    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (setenv "GITHUB_KEY" "/Users/jharder/.ssh/docker_github")
      (add-to-list 'exec-path "/usr/local/go/bin")
      (add-to-list 'exec-path "/opt/homebrew/bin")
      (add-to-list 'exec-path "/Library/TeX/texbin")
      (add-to-list 'exec-path "/Users/jharder/.rustup/toolchains/stable-aarch64-apple-darwin/bin")
    #+end_src

*** hook
    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (add-hook 'eshell-mode-hook
                (lambda ()
                  (setenv "TERM" "eterm")
                  (setenv "PAGER" "cat")))

    #+end_src
*** Settings

    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (require 'eshell)
      (add-to-list 'eshell-modules-list 'eshell-smart)

      (straight-use-package 'eshell-syntax-highlighting)
      (require 'eshell-syntax-highlighting)
      (eshell-syntax-highlighting-global-mode +1)

      ;; (require 'em-smart)
      ;; (setq eshell-where-to-jump 'begin)
      ;; (setq eshell-smart-space-goes-to-end nil)

      ;; (setq eshell-review-quick-commands nil)
      (require 'em-term)

      (setq eshell-visual-commands
            '("vi"
              "vim"
              "hx"
              "screen"
              "nvim"
              "bacon"
              ;; "gh"
              "tmux"
              "top"
              "htop"
              "less"
              "more"
              "lynx"
              "links"
              "ncftp"
              "mutt"
              "pine"
              "tin"
              "trn"
              "elm"))

      (setq eshell-visual-subcommands
            '(("jj" "squash" "split")))
    #+end_src

*** Completion

    I want more intelligent completion in eshell.

    This provides smart docker completion, not only for available
    subcommands, but also for realtime completion of available
    images in particular for commands like `run'. 

    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (defconst pcmpl-docker-commands
        '("run" "exec" "ps" "build" "pull" "images" "login" "logout"
          "search" "version" "info"
          "compose"))

      (defvar docker-images-command "docker image ls | tail -n +2 | awk '{ if($1 != \"<none>\") { if($2 == \"<none>\") { print $1 } else { printf(\"%s:%s\\n\", $1, $2) } } }'")
      (defun pcmpl-docker-images ()
        (let ((results (shell-command-to-string docker-images-command)))
          (string-split results "\n")))

      (defun pcomplete/docker ()
        "Completion for `docker'."
        (pcomplete-here* pcmpl-docker-commands)
        (cond
         ((pcomplete-match (regexp-opt '("run")) 1)
          (pcomplete-here* (pcmpl-docker-images)))))

    #+end_src
*** Custom functions
    #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
      (require 'eshell)
      (require 'esh-mode)

      (defun eshell/p ()
        (interactive)
        (eshell/pwd))

      (defun eshell/less (file)
        "Use `view-file' instead of less when viewing FILE."
        (interactive)
        (view-file file))

      (defun eshell/f (&optional file)
        "Shorthand for `find-file', opening FILE."
        (interactive)
        (if file
            (find-file file)
          (call-interactively #'find-file)))

      (defun eshell/d (&optional dir)
        "Run `dired' for directory DIR, or current dir if not given."
        (interactive)
        (if dir (dired dir) (dired ".")))

      (defun eshell/q ()
        "Kill the `eshell' process and close its window."
        (interactive)
        (if (one-window-p)
      	  (switch-to-buffer nil)
      	(delete-window)))

      (defun eshell-here ()
        "Open an `eshell' window relative to the active buffer's file."
        (interactive)
        (let* ((parent (if (buffer-file-name)
                           (file-name-directory (buffer-file-name))
                         default-directory))
               (name (car (last (split-string parent "/" t))))
               (buffer-name (concat "*eshell: " name "*")))
          (if-let* ((buffer (get-buffer buffer-name)))
              (progn
                (display-buffer buffer)
                (switch-to-buffer buffer))
            (eshell "new")
            (rename-buffer (concat "*eshell: " name "*"))
            (insert "ls")
            (eshell-send-input))))

    #+end_src
*** Prompt
Because eshell is just elisp, the prompt can be set using elisp as well.
This unlocks the full power of emacs as an environment and can be harnesed
to make eshell as fancy as you can dream up (and program)

#+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
  (setq eshell-prompt-function
        (lambda ()
          (let* ((home-path (getenv "HOME"))
                 (dir (string-replace home-path "~" (eshell/pwd)))
                 (branch nil)) ; (magit-get-current-branch)))
            (concat
             (propertize dir 'face `(:foreground "#61bfff"))
             (if branch
                 (concat (propertize " on \uE0A0 " 'face `(:foreground "white"))
                         (propertize branch 'face `(:foreground "green")))
               "")
             " $ "))))

  (setq eshell-prompt-regexp ".*$ ")
#+end_src
** Eat
  [[https://codeberg.org/akib/emacs-eat][Eat]] is a new kind of shell for emacs, handling fully interactive, fullscreen terminal apps
  cleanly. I think it can replace vterm, and has the benefit of not needing system
  dependencies nor a compilation step.

  #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
    (straight-use-package 'eat)
  #+end_src
** Vterm

   #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
     (straight-use-package 'vterm)
     (straight-use-package 'multi-vterm)
     (setq vterm-shell "/opt/homebrew/bin/nu")
   #+end_src
** Provide =my-shells=
   #+begin_src emacs-lisp :tangle "my-modules/my-shells.el" :mkdirp yes
     (provide 'my-shells)
   #+end_src

* Typst
    Typst is great. It's a modern and easy to use reimagining of LaTeX.

** Install package
    #+begin_src emacs-lisp :tangle "my-modules/my-typst.el" :mkdirp yes
      ;; -*- lexical-binding: t; -*-
      (straight-use-package
       '(typst-ts-mode
         :type git
         :host sourcehut
         :repo "meow_king/typst-ts-mode"
         :custom
         (typst-ts-mode-watch-options "--open")))
    #+end_src

** Provide feature =my-typst=
    #+begin_src emacs-lisp :tangle "my-modules/my-typst.el" :mkdirp yes
      (provide 'my-typst)
    #+end_src
 
* Navigation
** Windows
*** Winner mode

winner mode allows you to move back in time to prior window
configurations, though it is a mode that must be enabled in order to
record window configurations.

#+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
  (winner-mode 1)
#+end_src

