emacs/.config/emacs/config.org
*** ace-window

    Ace window is a handy way to supercharge `other-window' by giving
    each option a lettered target. Simply pressing that letter jumps
    straight to the targeted window, without having to cycle through
    any intermediate windows in the cycle.

    #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
      (straight-use-package 'ace-window)
      (setq aw-keys '(?1 ?2 ?3 ?4 ?5 ?6 ?7 ?8 ?9))
    #+end_src

*** Window management

    Window management in emacs is very powerful, but oft misunderstood.
    Here are some rules to inform emacs of where I want particular windows
    to go.

    #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
      (setq switch-to-buffer-obey-display-actions t)

      (add-to-list 'display-buffer-alist
                   '("\\*eshell.*\\*"
                     (display-buffer-at-bottom)
                     (side . bottom)
                     (slot . 0)
                     (window-height . .50)))

      ;; (add-to-list 'display-buffer-alist
      ;;              '("\\*vterm.*\\*"
      ;;                (display-buffer-at-bottom)
      ;;                (side . bottom)
      ;;                (slot . 0)
      ;; (window-height . .50)))

      (add-to-list 'display-buffer-alist
                   '("Calendar"
                     (display-buffer-below-selected)
                     (window-height . .20)))
    #+end_src

Growing, shrinking, and moving windows is a fairly common task, yet
usually involves resorting to the mouse, or performing a long series
of keyboard commands to perform the desired action solely through the
keyboard.  Using emacs' transient maps, we can create our own little
sub-mode with a persistent map.  This map defines some purpose-driven
commands around manipulating windows, and as soon as a key not in the
map is pressed, it exits the transient map and fires off the normal
command for the key as usual.

#+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
  (defun window-management-mode ()
    "Manipulate windows (size, location, number, etc)."
    (interactive)
    (let ((transient-keymap (make-sparse-keymap)))
      (define-key transient-keymap (kbd "j") (lambda ()
                                               (interactive) (enlarge-window 3)))
      (define-key transient-keymap (kbd "k") (lambda ()
                                               (interactive) (shrink-window 3)))
      (define-key transient-keymap (kbd "h") (lambda ()
                                               (interactive) (shrink-window-horizontally 3)))
      (define-key transient-keymap (kbd "l") (lambda ()
                                               (interactive) (enlarge-window-horizontally 3)))
      (define-key transient-keymap (kbd "v") #'split-window-right)
      (define-key transient-keymap (kbd "s") #'split-window-below)
      (define-key transient-keymap (kbd "c") #'delete-window)
      (define-key transient-keymap (kbd "o") #'delete-other-windows)
      (define-key transient-keymap (kbd "w") #'other-window)
      (define-key transient-keymap (kbd "L") #'evil-window-right)
      (define-key transient-keymap (kbd "H") #'evil-window-left)
      (define-key transient-keymap (kbd "J") #'evil-window-down)
      (define-key transient-keymap (kbd "K") #'evil-window-up)

      (set-transient-map transient-keymap t nil "Window management keymap: [j]grow height, [k]shrink height, [l]grow width, [h]shrink width
  [w]other-window [J]window-down [K]window-up [H]window-left [L]window-right
  [v]vertical-split [s]split
  [c]close-window [o]close-others")
      (message "Window management transient keymap activated.")))
#+end_src

** Ace jump

  Ace jump is a fantastic package that allows you to jump to any point on the screen with 3
  key presses or less. It's like using your mouse to go wherever you need, but without
  moving your hands off the keyboard.

  #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
    (straight-use-package 'ace-jump-mode)
  #+end_src

** Provide =my-navigation=
  #+begin_src emacs-lisp :tangle "my-modules/my-navigation.el" :mkdirp yes
    (provide 'my-navigation)
  #+end_src

* Web Browsing
** Convenience functions

   #+begin_src emacs-lisp :tangle "my-modules/my-web.el" :mkdirp yes
     (defun google-this (start end)
       "google-this googles either the selected region or the symbol at point.

     It makes use of the `browse-url' method which can be configured
     to query using a variety of tools.  By default, it will search
     using an external browser configured via the operating system."
       (interactive "rGoogle: ")
       (let ((query (if (region-active-p)
                        (buffer-substring start end)
                      (thing-at-point 'symbol t))))
         (browse-url (format "https://google.com/search?q=%s" query))))
   #+end_src
   
** Provide my-web

   #+begin_src emacs-lisp :tangle "my-modules/my-web.el" :mkdirp yes
     (provide 'my-web)
   #+end_src

* Email
** Mail server/client setup
  #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
    (setq send-mail-function 'smtpmail-send-it)
    (setq smtpmail-default-smtp-server "smtp.gmail.com"
          smtpmail-smtp-server "smtp.gmail.com"
          smtpmail-stream-type 'tls
          smtpmail-smtp-service 465
          user-mail-address "jharder@kipsu.com")
  #+end_src

** mbsync setup
At this point you shouldn't be surprised to find that emacs has decent support for sending
and receiving emails. It even has a mail retrieval utility built in, rmail.

This setup requires ~isync~ to be installed on the host machine (a.k.a. the vestigial
layer that separates emacs from the motherboard).

Google specific configuration/:
You will need an application password (create one [[https://myaccount.google.com/apppasswords][here]]). I store
For mbsync, I store this file here: [[file:~/gmail_app_pass.gpg]]. This
allows us to read mail from gmail for notmuch to index.
Save this value into a secure place, ideally encrypted. Emacs
supports gpg encryption out of the box, so this is a good option.

In order to send mail however, we need to have a record in:
[[file:~/.authinfo.gpg]] with a record for googles smtp server:

#+begin_src text
  machine smtp.gmail.com login your.email@example.com port 465 password YOUR_PASSWORD
#+end_src

This password must be the same as the app password created above and
stored previously.

NOTE*: as of [2023-10-16 Mon], there is a known issue with mbsync pulling from (at least for gmail)
remote inboxes. It runs for a time, then errors out with a socket error complaining about
an unexpected EOF. This has been patched, but is not yet in the homebrew formula, so we install
from =master=.

brew install --HEAD isync~

It also requires a mbsync configuration file to work correctly. [[file:~/.mbsyncrc][~/.mbsyncrc]]

** Notmuch
*** Meta: setup
from there just configure it

src_sh[]{notmuch setup}

and let notmuch index your mail

src_sh[]{notmuch new}
*** Require the project
#+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
  (straight-use-package 'notmuch)
#+end_src

*** Enable org links generated from notmuch
#+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
  ;; (straight-use-package 'ol-notmuch)
#+end_src

*** Configuring notmuch
**** Composing emails
#+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
  (defun my-notmuch-message-mode-hook ()
    (auto-fill-mode -1)
    (visual-line-mode 1))

    (add-hook 'notmuch-message-mode-hook #'my-notmuch-message-mode-hook)
#+end_src

**** Hello sections
    The following configures the "hello" (start) page of notmuch. This page is
    the default view when running the command ~notmuch~.

    This configures the sections on the hello page of notmuch. I don't like the
    header because it doesn't provide any useful information for me.

    I also remove the "recent searches" because these can be easily retrieved
    in buffer history when executing a search with =s=.

    #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
      (setq notmuch-hello-sections
	    '(notmuch-hello-insert-saved-searches
	      notmuch-hello-insert-search
	      notmuch-hello-insert-alltags
	      notmuch-hello-insert-footer))
    #+end_src

**** Saved searches

   #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
     (setq notmuch-saved-searches
	   '((:name "attachments" :query "tag:attachment" :key "a")
	     (:name "inbox" :query "tag:inbox" :key "i")
	     (:name "unread" :query "tag:unread" :key "u")
	     (:name "flagged" :query "tag:flagged" :key "f")
	     (:name "drafts" :query "tag:draft" :key "d")
	     (:name "today's mail" :query "date:today tag:inbox tag:unread" :key ".")
	     (:name "Todo" :query "tag:todo" :key "t")
	     (:name "This Week" :query "date:mon..today tag:inbox" :key "w")
	     (:name "Pull requests" :query "tag:pullrequest not tag:deleted" :key "p")
	     (:name "Sent" :query "is:sent" :key "s")))
   #+end_src

**** Sorting

   #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
     (setq notmuch-search-oldest-first nil)
   #+end_src
*** Bindings
Evilified bindings to notmuch

**** Search mode
#+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
  (defun notmuch-search-delete-threads (&optional beg end)
    (interactive (notmuch-interactive-region))
    (notmuch-search-tag '("+deleted" "-inbox") beg end)
    (notmuch-search-next-thread))

  ;; TODO: this function could be made more generic by checking
  ;; to see which notmuch mode we are in and calling the relevant
  ;; `notmuch-*-tag' function. e.g. `notmuch-search-tag', `notmuch-show-tag', etc.
  (defun notmuch-search-add-todo-tag (&optional beg end)
    (interactive (notmuch-interactive-region))
    (notmuch-search-tag '("+todo") beg end)
    (notmuch-search-next-thread))
#+end_src
       
**** Show mode
#+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
  (defun notmuch-show-delete-thread ()
    (interactive)
    (notmuch-show-tag '("+deleted" "-inbox")))

  (defun notmuch-show-tag-todo ()
    (interactive)
    (notmuch-show-tag '("+todo")))
#+end_src
   
** Provide =my-email=
  #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
    (provide 'my-email)
  #+end_src
* Text
** Mixed pitch mode
    Variable pitch (or proportional) fonts are those fonts which have
    different widths on a per-character basis. These are typically
    better for prose.

    Fixed pitch fonts are those which have the same width for each
    character. This means code formatting is preserved relative to
    each line, and does not vary on which letters are typed. This
    tends to be preferred for code.

    Using variable pitch fonts in text-inheriting modes is nice, but
    results in things like org source blocks using the same variable
    pitch as your prose.

    Fortunately, the ~mixed-pitch~ package is aware of the different
    font requirements of such modes and will use both variable and
    fixed pitch fonts in the same buffer according to use.

    #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
      (straight-use-package 'mixed-pitch)
    #+end_src

** Fill column
   Auto-fill mode uses a fixed column number to inform when emacs will
   insert a newline.

   Lets set it to something reasonable.

   #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
     (set-fill-column 80)
   #+end_src
** Text-mode hook
  #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
    (defun my-text-mode-hook ()
      (auto-fill-mode 1)
      (flyspell-mode 1))

    (add-hook 'text-mode-hook #'my-text-mode-hook)
  #+end_src

** Functions
*** Cycle capitalize word
    #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
      (defun cycle-capitalization ()
      	"Cycle capitalization of previous word.

      Capitalization schemes are:
      	- Regular capitalization: ensure only the first letter is capitalized
      	- All caps: Capitalize all letters of the word
      	- No caps: No Letters of the word are capitalized"
      	(interactive)
      	(let ((state (capitalize-state)))
      	  (save-excursion
      	    (goto-char (beginning-of-thing 'word))
      	    (cond
      	     ((eq 'lower state)
      	      (capitalize-word 1))
      	     ((eq 'capital state)
      	      (upcase-word 1))
      	     ((eq 'all-caps state)
      	      (downcase-word 1))))))

      (defun capitalize-state ()
        "Return a symbol representing the capitalization state of the previous word.

      Returns one of: 'lower, 'capital, or 'all-caps under the following senarios:

      	'lower    The first character of the word is alpha and lowercase.
      	'capital  The first character of the word is alpha and uppercase (but not every character in the word is uppercase.)
      	'all-caps All letters of the word are alpha and uppercase."
        (interactive)
        (let* ((word (word-at-point t))
      	     (upper-first-char-p (char-uppercase-p (string-to-char word)))
      	     (all-upper-p (map-every-p (lambda (i val) (char-uppercase-p val)) word)))
      	(cond
      	 (all-upper-p 'all-caps)
      	 (upper-first-char-p 'capital)
      	 (t 'lower))))

      (define-key global-map [remap capitalize-word] #'cycle-capitalization)
    #+end_src
     

** Provide =my-text=
  #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
    (provide 'my-text)
  #+end_src
* Timers (tmr)
The famous Prot has created the tmr package which makes setting timers
very easy.

#+begin_src emacs-lisp :tangle "my-modules/my-timers.el" :mkdirp yes
  (straight-use-package 'tmr)
  (require 'tmr)
  (provide 'my-timers)
#+end_src
* Git
** Magit
  Magit is amazing
  
**** Install the package

  #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
    (straight-use-package
     '(magit :type git :host github :repo "magit/magit"))
  #+end_src

** Forge
    Forges are a term representing a centralized version control
    location, like github. Magit bundles support for viewing content
    from forges (like pull requests), when required.

    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (straight-use-package 'forge)
    #+end_src
    
** Git gutters
    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (straight-use-package 'diff-hl)
      (global-diff-hl-mode 1)
    #+end_src
** Provide =my-git=
   #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
     (provide 'my-git)
   #+end_src

* Help utilities
  This encompasses man pages, info pages, describe-* windows, etc.
** Helpful package
    #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
      (straight-use-package 'helpful)
    #+end_src
** Provide =my-help=
   #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
     (provide 'my-help)
   #+end_src
* Just mode
    Just is a command line tool that seeks to simplify [[man:make]]
** Use package

    #+begin_src emacs-lisp :tangle "my-modules/my-just.el" :mkdirp yes
      (straight-use-package 'just-mode)
    #+end_src

** Provide package
    #+begin_src emacs-lisp :tangle "my-modules/my-just.el" :mkdirp yes
      (provide 'my-just)
    #+end_src

